.. _pan_userguide:

PAN Strings
============

Introduction
------------

The function :func:`clean_in_pan() <dataprep.clean.clean_in_pan.clean_in_pan>` cleans a column containing Indian Permanent Account number (PAN) strings, and standardizes them in a given format. The function :func:`validate_in_pan() <dataprep.clean.clean_in_pan.validate_in_pan>` validates either a single PAN strings, a column of PAN strings or a DataFrame of PAN strings, returning `True` if the value is valid, and `False` otherwise.

PAN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "ACUPA7085R"
* `standard`: PAN strings with proper whitespace in the proper places. Note that in the case of PAN, the compact format is the same as the standard one.
* `info`: return a dictionary containing information that can be decoded from the PAN, like {'card_holder_type': 'Individual', 'initial': 'A'}.
* `mask`: mask the PAN as per CBDT masking standard, like "ACUPAXXXXR".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_in_pan()` and `validate_in_pan()`.

### An example dataset containing PAN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "pan": [
            'ACUPA7085R',
            '234123412347',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            pan                                           address
0    ACUPA7085R                                     123 Pine Ave.
1  234123412347                                           main st
2    7542011030                      1234 west main heights 57033
3    7552A10004                    apt 1 789 s maple rd manhattan
4    8019010008                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_in_pan`

By default, `clean_in_pan` will clean pan strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_in_pan
clean_in_pan(df, column = "pan")

            pan                                           address   pan_clean
0    ACUPA7085R                                     123 Pine Ave.  ACUPA7085R
1  234123412347                                           main st         NaN
2    7542011030                      1234 west main heights 57033         NaN
3    7552A10004                    apt 1 789 s maple rd manhattan         NaN
4    8019010008                robie house, 789 north main street         NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_in_pan(df, column = "pan", output_format="standard")

            pan                                           address   pan_clean
0    ACUPA7085R                                     123 Pine Ave.  ACUPA7085R
1  234123412347                                           main st         NaN
2    7542011030                      1234 west main heights 57033         NaN
3    7552A10004                    apt 1 789 s maple rd manhattan         NaN
4    8019010008                robie house, 789 north main street         NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

### `compact`

In [4]:
clean_in_pan(df, column = "pan", output_format="compact")

            pan                                           address   pan_clean
0    ACUPA7085R                                     123 Pine Ave.  ACUPA7085R
1  234123412347                                           main st         NaN
2    7542011030                      1234 west main heights 57033         NaN
3    7552A10004                    apt 1 789 s maple rd manhattan         NaN
4    8019010008                robie house, 789 north main street         NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

### `info`

In [5]:
clean_in_pan(df, column = "pan", output_format="info")

,pan,address,pan_clean
0,ACUPA7085R,123 Pine Ave.,"{'card_holder_type': 'Individual', 'initial': ..."
1,234123412347,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `mask`

In [6]:
clean_in_pan(df, column = "pan", output_format="mask")

            pan                                           address   pan_clean
0    ACUPA7085R                                     123 Pine Ave.  ACUPAXXXXR
1  234123412347                                           main st         NaN
2    7542011030                      1234 west main heights 57033         NaN
3    7552A10004                    apt 1 789 s maple rd manhattan         NaN
4    8019010008                robie house, 789 north main street         NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned PAN strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_in_pan(df, column="pan", inplace=True)

    pan_clean                                           address
0  ACUPA7085R                                     123 Pine Ave.
1         NaN                                           main st
2         NaN                      1234 west main heights 57033
3         NaN                    apt 1 789 s maple rd manhattan
4         NaN                robie house, 789 north main street
5         NaN         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_in_pan(df, "pan", errors="coerce")

            pan                                           address   pan_clean
0    ACUPA7085R                                     123 Pine Ave.  ACUPA7085R
1  234123412347                                           main st         NaN
2    7542011030                      1234 west main heights 57033         NaN
3    7552A10004                    apt 1 789 s maple rd manhattan         NaN
4    8019010008                robie house, 789 north main street         NaN
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

### `ignore`

In [9]:
clean_in_pan(df, "pan", errors="ignore")

,pan,address,pan_clean
0,ACUPA7085R,123 Pine Ave.,ACUPA7085R
1,234123412347,main st,234123412347
2,7542011030,1234 west main heights 57033,7542011030
3,7552A10004,apt 1 789 s maple rd manhattan,7552A10004
4,8019010008,"robie house, 789 north main street",8019010008
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_in_pan()`

`validate_in_pan()` returns `True` when the input is a valid PAN. Otherwise it returns `False`.

The input of `validate_in_pan()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_in_pan()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_in_pan()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_in_pan
print(validate_in_pan('ACUPA7085R'))
print(validate_in_pan('234123412347'))
print(validate_in_pan('7542011030'))
print(validate_in_pan('7552A10004'))
print(validate_in_pan('8019010008'))
print(validate_in_pan("hello"))
print(validate_in_pan(np.nan))
print(validate_in_pan("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_in_pan(df["pan"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: pan, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_in_pan(df, column="pan")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: pan, dtype: bool

### Only DataFrame

In [13]:
validate_in_pan(df)

     pan  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False